org 0x7C00 ; загрузка загрузочного сектора по адресу 0х7с00

start:

mov si, message

mov ah, 0x0e ; записываем в ah значение 0х0е для печати на экран

puts_loop:

lodsb ; загружаем очередной символ в al

test al, al ; проверка (нулевой символ означает конец строки)

jz puts_loop_exit ; если все закончилось, он прыгает на бесконечный цикл

int 0x10 ; инчаче вызываем прерывание для работы с экранмом

jmp puts_loop ; и прыгаем опять обратно на загрузку символов

puts_loop_exit:

jmp $ ; постоянно прыгает на адрес текущей строки в памяти (бесконечный цикл)

message:

db ' _____ _______ _____ ____ _____ _______ ', 10, 13, ' / ____|__ __|/\ | __ \ / __ \ / ____|__ __|/\ ', 10, 13, ' | (___ | | / \ | |__) | | | | (___ | | / \ ', 10, 13, ' \___ \ | | / /\ \ | _ /| | | |\___ \ | | / /\ \ ', 10, 13, ' ____) | | |/ ____ \| | \ \| |__| |____) | | |/ ____ \ ', 10, 13, ' |_____/ |_/_/ \_\_| \_\\____/|_____/ |_/_/ \_\', 0

finish:

times 510 - ($ - $$) db 0 ; добавление в машинный код нулей до адреса 510

dw 0xaa55 ; запись magic number (wow o_o)